toy-app/app/controllers/users_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
  def show
    @user_micropost = @user.microposts.first